# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, SAF, [64]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, LCEB, [128, [3, 5]]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 3, LCEB, [256, [3, 5]]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 1, LCEB, [512, [1, 3]]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, Conv, [512, 3, 1]],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, SDF, [512]],  # cat backbone P4
   [-1, 1, Bottleneck, [512]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, SDF, [256]],  # cat backbone P3
   [-1, 1, Bottleneck, [256]],  # 17 (P3/8-small)

   [[16, 12, 9], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
